print(7 + 2)
print(7 - 2)
print(7 * 2)
print(7 / 2)
print(7 // 2)  # Целочисленное деление
print(7 ** 2)  # Степень
print(7 % 2)   # Остаток от деления (ближайшее к 7, что делится без остатка на 2, это 6: 7-6=1)
print("Небольшой пример о расстановке приоритетов в уравнениях:")
Number = 3 + 4 * 5 ** 2 + 7
print(Number)
print("А теперь со скобками:")
Number = (3 + 4) * (5 ** 2 + 7)
print(Number)   # Если в одной операции участвует целое число (int) и число с плавающей точкой (float), то целое число приводится к типу float.

